In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import matplotlib
matplotlib.rcParams['figure.figsize'] = (20,10)

In [2]:
df1 = pd.read_csv('../Datasets/HousePriceAtUSA.csv')
df1.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

In [3]:
df1.city.unique()

array(['Shoreline', 'Seattle', 'Kent', 'Bellevue', 'Redmond',
       'Maple Valley', 'North Bend', 'Lake Forest Park', 'Sammamish',
       'Auburn', 'Des Moines', 'Bothell', 'Federal Way', 'Kirkland',
       'Issaquah', 'Woodinville', 'Normandy Park', 'Fall City', 'Renton',
       'Carnation', 'Snoqualmie', 'Duvall', 'Burien', 'Covington',
       'Inglewood-Finn Hill', 'Kenmore', 'Newcastle', 'Mercer Island',
       'Black Diamond', 'Ravensdale', 'Clyde Hill', 'Algona', 'Skykomish',
       'Tukwila', 'Vashon', 'Yarrow Point', 'SeaTac', 'Medina',
       'Enumclaw', 'Snoqualmie Pass', 'Pacific', 'Beaux Arts Village',
       'Preston', 'Milton'], dtype=object)

In [4]:
len(df1.city.unique())

44

In [5]:
df1.street.unique()

array(['18810 Densmore Ave N', '709 W Blaine St',
       '26206-26214 143rd Ave SE', ..., '759 Ilwaco Pl NE',
       '5148 S Creston St', '18717 SE 258th St'], dtype=object)

In [6]:
len(df1.street.unique())

4525

In [7]:
df1.groupby('city')['street'].agg('count')

city
Algona                    5
Auburn                  176
Beaux Arts Village        1
Bellevue                286
Black Diamond             9
Bothell                  33
Burien                   74
Carnation                22
Clyde Hill               11
Covington                43
Des Moines               58
Duvall                   42
Enumclaw                 28
Fall City                11
Federal Way             148
Inglewood-Finn Hill       1
Issaquah                187
Kenmore                  66
Kent                    185
Kirkland                187
Lake Forest Park         36
Maple Valley             96
Medina                   11
Mercer Island            86
Milton                    2
Newcastle                33
Normandy Park            18
North Bend               50
Pacific                   6
Preston                   2
Ravensdale                7
Redmond                 235
Renton                  293
Sammamish               175
SeaTac                   29
Seattle                1573
Shoreline               123
Skykomish                 3
Snoqualmie               71
Snoqualmie Pass           1
Tukwila                  29
Vashon                   29
Woodinville             115
Yarrow Point              4
Name: street, dtype: int64

In [8]:
df1.head(1)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.5,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA

In [9]:
df1.columns.to_list()

['date',
 'price',
 'bedrooms',
 'bathrooms',
 'sqft_living',
 'sqft_lot',
 'floors',
 'waterfront',
 'view',
 'condition',
 'sqft_above',
 'sqft_basement',
 'yr_built',
 'yr_renovated',
 'street',
 'city',
 'statezip',
 'country']

In [10]:
df1.shape

(4600, 18)

In [14]:
df2 = df1.drop(['date','street','statezip','country','waterfront','yr_built','yr_renovated'],axis='columns')
df2.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,view,condition,sqft_above,sqft_basement,city
0,313000.0,3.0,1.50,1340,7912,1.5,0,3,1340,0,Shoreline
1,2384000.0,5.0,2.50,3650,9050,2.0,4,5,3370,280,Seattle
2,342000.0,3.0,2.00,1930,11947,1.0,0,4,1930,0,Kent
3,420000.0,3.0,2.25,2000,8030,1.0,0,4,1000,1000,Bellevue
4,550000.0,4.0,2.50,1940,10500,1.0,0,4,1140,800,Redmond

### basement = 0 or 1 if basement_sqf>1
### add the sqfeet only if nessasary

In [15]:
df2.isnull().sum()

price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
view             0
condition        0
sqft_above       0
sqft_basement    0
city             0
dtype: int64

In [16]:
def basement_conversion(sqft):
    return 1 if sqft>=1 else 0

In [17]:
df2['basement'] = df2['sqft_basement'].apply(basement_conversion)
df2.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,view,condition,sqft_above,sqft_basement,city,basement
0,313000.0,3.0,1.50,1340,7912,1.5,0,3,1340,0,Shoreline,0
1,2384000.0,5.0,2.50,3650,9050,2.0,4,5,3370,280,Seattle,1
2,342000.0,3.0,2.00,1930,11947,1.0,0,4,1930,0,Kent,0
3,420000.0,3.0,2.25,2000,8030,1.0,0,4,1000,1000,Bellevue,1
4,550000.0,4.0,2.50,1940,10500,1.0,0,4,1140,800,Redmond,1

In [18]:
df3 = df2.drop(['sqft_basement'],axis='columns')
df3.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,view,condition,sqft_above,city,basement
0,313000.0,3.0,1.50,1340,7912,1.5,0,3,1340,Shoreline,0
1,2384000.0,5.0,2.50,3650,9050,2.0,4,5,3370,Seattle,1
2,342000.0,3.0,2.00,1930,11947,1.0,0,4,1930,Kent,0
3,420000.0,3.0,2.25,2000,8030,1.0,0,4,1000,Bellevue,1
4,550000.0,4.0,2.50,1940,10500,1.0,0,4,1140,Redmond,1

In [19]:
def floor_conversion(number):
    # Get the integer and decimal parts
    integer_part = int(number)
    decimal_part = number - integer_part
    
    # Round based on the decimal part
    if decimal_part > 0.4:
        return integer_part + 1
    else:
        return integer_part

In [22]:
df3['floors'] = df3['floors'].apply(floor_conversion)
df3.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,view,condition,sqft_above,city,basement
0,313000.0,3.0,1.50,1340,7912,2,0,3,1340,Shoreline,0
1,2384000.0,5.0,2.50,3650,9050,2,4,5,3370,Seattle,1
2,342000.0,3.0,2.00,1930,11947,1,0,4,1930,Kent,0
3,420000.0,3.0,2.25,2000,8030,1,0,4,1000,Bellevue,1
4,550000.0,4.0,2.50,1940,10500,1,0,4,1140,Redmond,1

In [23]:
df3['bathrooms'] =  df3['bathrooms'].apply(floor_conversion)
df3.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,view,condition,sqft_above,city,basement
0,313000.0,3.0,2,1340,7912,2,0,3,1340,Shoreline,0
1,2384000.0,5.0,3,3650,9050,2,4,5,3370,Seattle,1
2,342000.0,3.0,2,1930,11947,1,0,4,1930,Kent,0
3,420000.0,3.0,2,2000,8030,1,0,4,1000,Bellevue,1
4,550000.0,4.0,3,1940,10500,1,0,4,1140,Redmond,1